## create dataframe student information

In [3]:
import pandas as pd
student_information = {
    'roll no':[101,102,103,104,105],
    'name':['riya','arjun','sneha','rakesh','aditi'],
    'age':[17,18,17,19,18],
    'marks_maths':[88,75,90,65,95],
    'marks_english':[92,85,78,70,88],
    'gender':['F','M','F','M','F']
}
df=pd.DataFrame(student_information)
print(df)

   roll no    name  age  marks_maths  marks_english gender
0      101    riya   17           88             92      F
1      102   arjun   18           75             85      M
2      103   sneha   17           90             78      F
3      104  rakesh   19           65             70      M
4      105   aditi   18           95             88      F

## 2) Display only the names and english marks of the all student

In [4]:
print(df['name']),df['marks_english']

0      riya
1     arjun
2     sneha
3    rakesh
4     aditi
Name: name, dtype: object

(None,
 0    92
 1    85
 2    78
 3    70
 4    88
 Name: marks_english, dtype: int64)

## 3) Add a new column "total_marks" as the sum of marks math and eng

In [5]:
df['total_marks']=df[['marks_maths','marks_english']].sum(axis=1)
print(df)

   roll no    name  age  marks_maths  marks_english gender  total_marks
0      101    riya   17           88             92      F          180
1      102   arjun   18           75             85      M          160
2      103   sneha   17           90             78      F          168
3      104  rakesh   19           65             70      M          135
4      105   aditi   18           95             88      F          183

## 4) find the average marks in maths using a pandas function

In [6]:
df['average']=df[['marks_maths']].mean(axis=1)
print(df['average'])

0    88.0
1    75.0
2    90.0
3    65.0
4    95.0
Name: average, dtype: float64

## 5) Display the records of feamale student

In [7]:
only_feamale=df[df['gender'] == 'F']
print(only_feamale)

   roll no   name  age  marks_maths  marks_english gender  total_marks  \
0      101   riya   17           88             92      F          180
2      103  sneha   17           90             78      F          168
4      105  aditi   18           95             88      F          183

   average
0     88.0
2     90.0
4     95.0

## 6) Sort the dataframe by marks english in descending order

In [9]:
sort_df=df.sort_values(by='marks_english',ascending=False)
print(sort_df)

   roll no    name  age  marks_maths  marks_english gender  total_marks  \
0      101    riya   17           88             92      F          180
4      105   aditi   18           95             88      F          183
1      102   arjun   18           75             85      M          160
2      103   sneha   17           90             78      F          168
3      104  rakesh   19           65             70      M          135

   average
0     88.0
4     95.0
1     75.0
2     90.0
3     65.0

## 7) Replace the gender values :'F' 'Feamale' ,"M" "male"  using .map()

In [29]:
df['gender']=df['gender'].map({'M': 'F','F':'m'})
print(df)

   roll no    name  age  marks_maths  marks_english gender  total_marks  \
0      101    riya   17           88             92      m          180
1      102   arjun   18           75             85      F          160
2      103   sneha   17           90             78      m          168
3      104  rakesh   19           65             70      F          135
4      105   aditi   18           95             88      m          183

   average
0     88.0
1     75.0
2     90.0
3     65.0
4     95.0

## 8) add a new column result with value "pass" if total marks >=150,else "fail" (using apply() with lambda)

In [30]:
df['result']=df['total_marks'].apply(lambda x:'pass' if x>=150 else 'Fail')
print(df)

   roll no    name  age  marks_maths  marks_english gender  total_marks  \
0      101    riya   17           88             92      m          180
1      102   arjun   18           75             85      F          160
2      103   sneha   17           90             78      m          168
3      104  rakesh   19           65             70      F          135
4      105   aditi   18           95             88      m          183

   average result
0     88.0   pass
1     75.0   pass
2     90.0   pass
3     65.0   Fail
4     95.0   pass

## 9) use map() to convert all names to uppercase from the name column

In [31]:
f=df['name'].map(lambda x: x.upper())
print(f)

0      RIYA
1     ARJUN
2     SNEHA
3    RAKESH
4     ADITI
Name: name, dtype: object

## 10) use filter() to get the list of the students whose marks maths is greater than 80

In [32]:
MM=df[df['marks_maths']>80]
print(MM)

   roll no   name  age  marks_maths  marks_english gender  total_marks  \
0      101   riya   17           88             92      m          180
2      103  sneha   17           90             78      m          168
4      105  aditi   18           95             88      m          183

   average result
0     88.0   pass
2     90.0   pass
4     95.0   pass

# 11) use lambda to create new column grade 
## a) if total marks >170
## b) if total marks > 150
## c) otherwise

In [33]:
df['grade']=df['total_marks'].apply(lambda x: "A" if x >= 170 else ("B" if x >= 150  else "c"))
print(df)

   roll no    name  age  marks_maths  marks_english gender  total_marks  \
0      101    riya   17           88             92      m          180
1      102   arjun   18           75             85      F          160
2      103   sneha   17           90             78      m          168
3      104  rakesh   19           65             70      F          135
4      105   aditi   18           95             88      m          183

   average result grade
0     88.0   pass     A
1     75.0   pass     B
2     90.0   pass     B
3     65.0   Fail     c
4     95.0   pass     A

## 12) use reduce() caluculate the total of the all math marks

In [34]:
from functools import reduce
tmm=reduce(lambda x,y: x+y,df['marks_maths'])
print(tmm)

413

## 13) count how many students are below the age of 18

In [35]:
count = df[df['age'] >=18]
print(count)

   roll no    name  age  marks_maths  marks_english gender  total_marks  \
1      102   arjun   18           75             85      F          160
3      104  rakesh   19           65             70      F          135
4      105   aditi   18           95             88      m          183

   average result grade
1     75.0   pass     B
3     65.0   Fail     c
4     95.0   pass     A

## 14) create a new column average which gives average of the both subjects

In [36]:
df['avg']=df[['marks_maths','marks_english']].sum(axis=1)/2
df['avg1']=df['total_marks']/2
print(df)

   roll no    name  age  marks_maths  marks_english gender  total_marks  \
0      101    riya   17           88             92      m          180
1      102   arjun   18           75             85      F          160
2      103   sneha   17           90             78      m          168
3      104  rakesh   19           65             70      F          135
4      105   aditi   18           95             88      m          183

   average result grade   avg  avg1
0     88.0   pass     A  90.0  90.0
1     75.0   pass     B  80.0  80.0
2     90.0   pass     B  84.0  84.0
3     65.0   Fail     c  67.5  67.5
4     95.0   pass     A  91.5  91.5

## 15) display names of the student who scored more in english than math

In [37]:
eng=df[df['marks_english']>df['marks_maths']]
print(eng)

   roll no    name  age  marks_maths  marks_english gender  total_marks  \
0      101    riya   17           88             92      m          180
1      102   arjun   18           75             85      F          160
3      104  rakesh   19           65             70      F          135

   average result grade   avg  avg1
0     88.0   pass     A  90.0  90.0
1     75.0   pass     B  80.0  80.0
3     65.0   Fail     c  67.5  67.5

## 16) Group students by gender and caluculate average marks of each gender

In [38]:
avg=df.groupby('gender')['total_marks'].mean()
print(avg)

gender
F    147.5
m    177.0
Name: total_marks, dtype: float64

## 17) find the student with the highest total marks using pandas

In [39]:
t=df[['total_marks','name']].max()
print(t)

total_marks      183
name           sneha
dtype: object